research/visualization_methods/outputs/Kalman filtering and smoothing__rotate_ssm/rotate_ssm.dot
digraph G {
  "A" [label="A"];
  "B" [label="B"];
  "MvNormalMeanCovariance" [label="MvNormalMeanCovariance"];
  "P" [label="P"];
  "Q" [label="Q"];
  "i" [label="i"];
  "x" [label="x"];
  "x_prev" [label="x_prev"];
  "y" [label="y"];
  "A" -> "x";
  "B" -> "y";
  "MvNormalMeanCovariance" -> "x";
  "MvNormalMeanCovariance" -> "y";
  "P" -> "x";
  "Q" -> "y";
  "i" -> "y";
  "x" -> "y";
  "x_prev" -> "x";
}
