research/visualization_methods/outputs/Kalman filtering and smoothing__rotate_ssm/rotate_ssm.mmd
graph TD
  A["A"]
  B["B"]
  MvNormalMeanCovariance["MvNormalMeanCovariance"]
  P["P"]
  Q["Q"]
  i["i"]
  x["x"]
  x_prev["x_prev"]
  y["y"]
  A --> x
  B --> y
  MvNormalMeanCovariance --> x
  MvNormalMeanCovariance --> y
  P --> x
  Q --> y
  i --> y
  x --> y
  x_prev --> x
